-- 游戏启动
gameRun = {}

-- 游戏启动 开始游戏界面按钮
gameRun["startGameColor"] = {
    {  278,  787, 0x81ffff},
    {  280,  787, 0x81ffff},
    {  282,  787, 0x81ffff},
    {  283,  789, 0x041574},
    {  284,  789, 0x021172},
    {  284,  790, 0x021172},
    {  284,  790, 0x021172},
    {  284,  791, 0x021172},
    {  284,  792, 0x021172},
    {  282,  792, 0x81ffff},
}

-- 游戏主界面可能的弹窗
gameMainPop = {}

-- 游戏主界面可能的弹窗 登录后弹出的广告确认按钮
gameMainPop["loginPopSureColor"] = {
    {164, 695, 0x16a9f0},
    {260, 710, 0xffffff},
    {270, 713, 0x041b47},
    {276, 714, 0x233557},
    {278, 720, 0x2b3b55},
    {262, 720, 0xffffff},
    {244, 720, 0x083689},
    {256, 726, 0x203f76},
    {269, 725, 0x062867},
    {302, 726, 0x093991}
}

-- 竞技场主页
pvpFieldMain = {}

-- 竞技场主页 选中状态的底部竞技场
pvpFieldMain["pvpFieldChoosedColor"] = {
    {  214, 1256, 0x2667e9},
    {  215, 1256, 0x2b6ae9},
    {  239, 1265, 0xbbcff8},
    {  240, 1267, 0xe4ecfc},
    {  258, 1267, 0xacc5f7},
    {  261, 1266, 0x7da4f2},
    {  267, 1266, 0x0049ee},
    {  212, 1229, 0x2055c1},
    {  217, 1230, 0x387dda},
    {  221, 1193, 0xddfcff},
}

-- 休闲决斗
funnyPvp = {}

-- 休闲决斗 决斗列表中的休闲决斗
funnyPvp["listFunnyPvpColor"] = {
    {   64,  752, 0xffcc00},
    {   64,  785, 0xffcc00},
    {   79,  791, 0x000000},
    {   38,  829, 0x08a405},
    {   68,  838, 0xbb9600},
    {  139,  757, 0x091903},
    {  154,  738, 0x020d00},
    {  155,  788, 0x7d6400},
    {  163,  801, 0xffcc00},
    {  156,  864, 0xffffff},
}

-- 休闲决斗 开始决斗
funnyPvp["funnyPvpStartColor"] = {
    {  378,  543, 0xf7e431},
    {  378,  546, 0xf8db2b},
    {  376,  546, 0xb5a63e},
    {  376,  548, 0x888039},
    {  376,  549, 0x7a743a},
    {  376,  549, 0x7a743a},
    {  376,  549, 0x7a743a},
    {  376,  551, 0x5e5d3d},
    {  378,  551, 0xfaca20},
    {  378,  561, 0xfdaa09},
}
-- 通用
general = {}

-- 通用 底部下一步
general["bottomNextColor"] = {
    {  321, 1201, 0xb9bcc3},
    {  325, 1204, 0xf1f2f3},
    {  326, 1205, 0xffffff},
    {  358, 1209, 0x031432},
    {  358, 1213, 0xffffff},
    {  358, 1216, 0x041b44},
    {  389, 1209, 0x49505b},
    {  389, 1208, 0x020a1a},
    {  393, 1197, 0x031940},
    {  379, 1228, 0x072967},
}

-- 通用 底部确定
general["bottomSureColor"] = {
    {  334, 1206, 0xfefefe},
    {  333, 1205, 0x253145},
    {  332, 1207, 0x041434},
    {  331, 1208, 0x041a43},
    {  331, 1208, 0x041a43},
    {  334, 1210, 0xffffff},
    {  336, 1213, 0x020917},
    {  337, 1214, 0x262d39},
    {  340, 1215, 0xffffff},
    {  341, 1216, 0x222a37},
}

-- 通用 战斗结束后升级
general["battleAfterLevelUpColor"] = {
    {  261,  425, 0x22beff},
    {  261,  431, 0x000387},
    {  260,  406, 0xddffef},
    {  308,  424, 0x008fff},
    {  317,  438, 0x00b8ff},
    {  322,  439, 0x05c6ff},
    {  348,  425, 0x001f8c},
    {  346,  388, 0xf7ffff},
    {  382,  430, 0x00b5ff},
    {  260,  457, 0x785694},
}

-- 通用 全屏弹框左下角返回
general["fullScreenPopBackColor"] = {
    {   47, 1227, 0xffffff},
    {   60, 1219, 0x002466},
    {   61, 1219, 0x092b66},
    {   61, 1221, 0x07296d},
    {   61, 1227, 0xffffff},
    {   64, 1224, 0x022f77},
    {   67, 1228, 0xffffff},
    {  109, 1258, 0xa3e8f7},
    {  109, 1260, 0xd6f9ff},
    {   15, 1202, 0x21aaff},
}

-- 通用 登录后游戏主页面
general["loginAfterMain"] = {
    {   44,   72, 0x0273c6},
    {   35,   75, 0x42d7ee},
    {   42,   85, 0x82ffff},
    {   43,   98, 0x102e6a},
    {   43,   93, 0x0d277f},
    {   63,   89, 0x2550c6},
    {   61,   84, 0x2348b6},
    {   78,   77, 0x11ccff},
    {    8,   79, 0x11ccff},
    {   45,   68, 0x002d86},
}

-- 通用 底部NPC聊天
general["bottomChat"] = {
    {  684,  954, 0x45bacc},
    {  711,  955, 0x005575},
    {  704,  955, 0x005568},
    {  706,  955, 0x2d8da4},
    {  693,  967, 0x006581},
    {  645,  978, 0x026082},
    {  648,  960, 0x00667b},
    {  622,  940, 0x006687},
    {  549,  983, 0x3ca2ba},
    {  540,  957, 0x3499ab},
}

-- 通用 获得新技能
general["getNewSkillColor"] = {
	{  215,  782, 0x12a9e7},
	{  221,  777, 0x0e9ed8},
	{  377,  792, 0xffffff},
	{  497,  837, 0xccf7ff},
	{  339,  800, 0xb0b4bb},
	{  340,  802, 0xffffff},
	{  341,  802, 0x2b3241},
	{  337,  805, 0x262d39},
	{  352,  810, 0xffffff},
	{  355,  811, 0xffffff},
}
-- 网络错误
netWorkError = {}

-- 网络错误 网络失败弹框
netWorkError["noNetWorkColor"] = {
    {362, 529, 0xffffff},
    {362, 530, 0xb9bcc2},
    {362, 531, 0x7c8390},
    {362, 532, 0xb5b9c1},
    {362, 533, 0xadb3be},
    {362, 534, 0xacb1bc},
    {362, 535, 0xacb2bc},
    {362, 536, 0xacb2bc},
    {362, 537, 0xaeb4bf},
    {362, 538, 0xb5bac5}
}

-- 网络错误 链接超时
netWorkError["netWorkOutTimeColor"] = {
    {251, 518, 0xffffff},
    {255, 527, 0xd8dadc},
    {254, 527, 0xffffff},
    {254, 526, 0xffffff},
    {253, 526, 0x9da0a7},
    {253, 525, 0xa4a6ac},
    {252, 526, 0x020a19},
    {252, 523, 0xffffff},
    {250, 523, 0xffffff},
    {250, 522, 0xfefefe}
}

-- 网络错误 连接错误
netWorkError["connectErrorColor"] = {
    {248, 530, 0xc8ccd6},
    {250, 531, 0x9da1aa},
    {250, 532, 0xabafb7},
    {250, 533, 0xe4e6e9},
    {250, 534, 0xfefefe},
    {250, 535, 0xffffff},
    {250, 536, 0xffffff},
    {250, 537, 0xffffff},
    {247, 541, 0x0c234d},
    {248, 542, 0x03183d}
}

-- 战斗中
battleIng = {}

-- 战斗中 右侧切换阶段
battleIng["changeRoundColor"] = {
    {  631,  830, 0xbdefff},
    {  629,  830, 0xccf7ff},
    {  628,  830, 0xccf1ff},
    {  634,  842, 0x96eeff},
    {  642,  846, 0x07184b},
    {  652,  820, 0x051e49},
    {  631,  810, 0xffffff},
    {  686,  809, 0xc8ffff},
    {  680,  797, 0xefffff},
    {  678,  841, 0x63edff},
}

-- 战斗中 你的回合 右上角时间蓝线
battleIng["pvpYourRoundColor"] = {
    {  577,  181, 0x2299ee},
    {  578,  181, 0x1399ee},
    {  581,  181, 0x0c9fee},
    {  583,  181, 0x1aaaf7},
    {  583,  180, 0x13aaf6},
    {  586,  180, 0x13abf2},
    {  589,  180, 0x15aefb},
    {  594,  180, 0x17bdfd},
    {  596,  180, 0x1abbfd},
    {  656,  181, 0x14aaf8},
}

-- 战斗中 你的主要阶段
battleIng["yourMainColor"] = {
    {  496,   73, 0x010512},
    {  496,   75, 0x0f0c00},
    {  497,   77, 0xffcc00},
    {  497,   77, 0xffcc00},
    {  494,   78, 0xd2a903},
    {  498,   78, 0xc29b00},
    {  498,   82, 0x000000},
    {  498,   91, 0x000000},
    {  501,   93, 0xfcca00},
    {  532,   89, 0xffcc00},
}
-- 战斗中 你的抽卡阶段
battleIng["yourInCardColor"] = {
    {  496,   79, 0xffcc00},
    {  499,   80, 0x634f00},
    {  498,   86, 0x231c00},
    {  498,   87, 0x000000},
    {  507,   88, 0xeabb00},
    {  505,   90, 0xcea500},
    {  505,   88, 0xb08d00},
    {  502,   88, 0xaa8800},
    {  532,   85, 0x282000},
    {  532,   87, 0xe4b600},
}

-- 战斗中 你的战斗阶段
battleIng["yourFightColor"] = {
    {  498,   81, 0x000000},
    {  496,   81, 0x554400},
    {  496,   81, 0x554400},
    {  498,   87, 0xf6c500},
    {  511,   92, 0xe8ba00},
    {  509,   75, 0xffcc00},
    {  520,   79, 0xc09a00},
    {  529,   83, 0x000000},
    {  538,   84, 0x8e7200},
    {  538,   86, 0xffcc00},
}

-- 主要阶段 召唤卡片
battleIng["mainWakeCardColor"] = {
    {  269,  926, 0x005577},
    {  269,  927, 0x005579},
    {  270,  928, 0x005586},
    {  270,  930, 0x00668e},
    {  270,  931, 0x006699},
    {  269,  934, 0x0075a1},
    {  268,  937, 0x3094b8},
    {  268,  937, 0x3094b8},
    {  254,  971, 0x000000},
    {  256,  976, 0xfbfbfb},
}

-- 战斗阶段 二号卡槽没卡
battleIng["withoutSecondCardColor"] = {
    {  322,  658, 0x9a9bac},
    {  323,  658, 0x999aab},
    {  324,  658, 0x999aab},
    {  325,  658, 0x999aab},
    {  326,  658, 0x999aab},
    {  328,  658, 0x999aab},
    {  329,  658, 0x999aab},
    {  330,  658, 0x999aab},
    {  331,  658, 0x999aab},
    {  332,  658, 0x999aab},
}

-- 战斗阶段 一号卡槽没卡
battleIng["withoutFirstCardColor"] = {
    {  170,  792, 0x9999a8},
    {  172,  792, 0x9a9aab},
    {  173,  792, 0x9a9aab},
    {  174,  792, 0x9a9aab},
    {  175,  792, 0x9a9aab},
    {  176,  792, 0x9a9aab},
    {  178,  792, 0x9a9aab},
    {  179,  792, 0x9a9aab},
    {  180,  792, 0x9a9aab},
    {  181,  792, 0x9a9aab},
}

-- 战斗阶段 三号卡槽没卡
battleIng["withoutThirdCardColor"] = {
    {  468,  792, 0x9999a6},
    {  469,  792, 0x9a9aab},
    {  470,  792, 0x9a9aab},
    {  472,  792, 0x9a9aab},
    {  473,  792, 0x9a9aab},
    {  474,  792, 0x9a9aab},
    {  475,  792, 0x9a9aab},
    {  476,  792, 0x9a9aab},
    {  478,  792, 0x9a9aab},
    {  479,  792, 0x9a9aab},
}

-- 战斗中 第一回合
battleIng["fristRoundColor"] = {
    {  551,   20, 0x000000},
    {  552,   24, 0xeeeeee},
    {  556,   27, 0x000000},
    {  547,   51, 0xeeeeee},
    {  547,   53, 0x2d2d2d},
    {  547,   49, 0xffffff},
    {  538,   47, 0x3c5071},
    {  546,   48, 0xffffff},
    {  553,   48, 0x606060},
    {  572,   39, 0x051a57},
}

-- 战斗中 一位数回合
battleIng["oneDigitRoundColor"] = {
    {  571,   26, 0x002266},
    {  577,   30, 0x002a6a},
    {  572,   42, 0x093482},
    {  572,   48, 0x002055},
    {  577,   49, 0x04266f},
    {  579,   50, 0x01337e},
    {  586,   41, 0x03357c},
    {  580,   40, 0x053164},
    {  583,   29, 0x012d77},
    {  580,   26, 0x00226d},
}

-- 战斗阶段 第一张卡片打过了
battleIng["firstCardUsedColor"] = {
    {136, 481, 0x000007},
    {137, 482, 0x00000a},
    {139, 483, 0x00000d},
    {140, 484, 0x000011},
    {141, 485, 0x000015},
    {142, 486, 0x000019},
    {143, 487, 0x00001d},
    {145, 488, 0x000121},
    {146, 489, 0x000025},
    {147, 490, 0x000026}
}

-- 战斗阶段 第二张卡片打过了
battleIng["secondCardUsedColor"] = {
    {237, 484, 0x000010},
    {238, 485, 0x000013},
    {239, 486, 0x000017},
    {241, 487, 0x00001c},
    {242, 488, 0x000021},
    {243, 489, 0x000128},
    {244, 490, 0x00012b},
    {244, 490, 0x00012b},
    {245, 491, 0x00012c},
    {260, 490, 0x00002b}
}

-- 战斗阶段 第三张卡片打过了
battleIng["thirdCardUsedColor"] = {
    {350, 480, 0x000002},
    {351, 481, 0x000005},
    {352, 482, 0x000009},
    {353, 483, 0x00000d},
    {355, 484, 0x000011},
    {356, 485, 0x000015},
    {357, 486, 0x000019},
    {358, 487, 0x00001b},
    {359, 488, 0x000121},
    {361, 489, 0x000126}
}
--战斗中出现操作卡的选项
battleIng["operateCardColor"] = {
	{  319, 1075, 0x363636},
	{  327, 1075, 0x737373},
	{  330, 1076, 0xffffff},
	{  336, 1084, 0x717172},
	{  349, 1084, 0xcccccd},
	{  352, 1083, 0x0b0b0b},
	{  357, 1084, 0x878888},
	{  367, 1091, 0xffffff},
	{  373, 1086, 0x202122},
	{  371, 1072, 0xffffff},
}
-- 决斗门
door = {}

-- 决斗门 点击圆形决斗门
door["tapBattleDoorColor"] = {
    {98, 96, 0x616d9a},
    {98, 98, 0xfafbfc},
    {98, 99, 0xf9fafc},
    {98, 100, 0xf9fafc},
    {98, 101, 0xfefefe},
    {98, 102, 0xffffff},
    {98, 104, 0xf9fafc},
    {98, 105, 0xf9fafc},
    {98, 106, 0xfbfcfd},
    {98, 107, 0xffffff}
}

-- 决斗门 高等级怪物弹框
door["highLevelPopSureColor"] = {
    {364, 542, 0xc1c6ce},
    {364, 544, 0x03132f},
    {364, 545, 0x13233f},
    {364, 546, 0x546075},
    {364, 547, 0xb8bdc5},
    {364, 548, 0xf4f5f6},
    {364, 550, 0xffffff},
    {364, 551, 0xf3f4f5},
    {364, 552, 0xd3d5da},
    {364, 554, 0xbec2cb}
}

-- 决斗门 底部开始决斗
door["bottomBeginBattleColor"] = {
    {254, 826, 0xf6e934},
    {254, 827, 0xf7e532},
    {255, 827, 0xf7e532},
    {255, 828, 0xf7e230},
    {255, 829, 0xf7df2e},
    {255, 831, 0xf8d829},
    {255, 832, 0xf9d527},
    {255, 832, 0xf9d527},
    {255, 833, 0xf9d225},
    {255, 834, 0xf9cf23}
}

-- 决斗门 钥匙数量不足
door["keyNoStockColor"] = {
    {108, 824, 0xb4b4b5},
    {108, 825, 0x848486},
    {107, 828, 0xffffff},
    {108, 829, 0xffffff},
    {115, 829, 0xffffff},
    {124, 829, 0xffffff},
    {127, 831, 0xc8c8c9},
    {140, 831, 0xffffff},
    {140, 832, 0xffffff},
    {140, 833, 0xffffff}
}
