-- 颜色列表
colorTable = {}

-- 开始游戏界面按钮
colorTable["startGameColor"] = {
	{210, 599, 0x81ffff},
	{238, 598, 0x81ffff},
	{251, 597, 0x7ef9fc},
	{250, 603, 0x81ffff},
	{264, 605, 0x81ffff},
	{274, 598, 0x051876},
	{280, 602, 0x81ffff},
	{278, 606, 0x3672ac},
	{278, 606, 0x3672ac},
	{292, 600, 0x81ffff}
}

-- 登录后弹出的确认
colorTable["loginPopSureColor"] = {
	{164, 695, 0x16a9f0},
	{260, 710, 0xffffff},
	{270, 713, 0x041b47},
	{276, 714, 0x233557},
	{278, 720, 0x2b3b55},
	{262, 720, 0xffffff},
	{244, 720, 0x083689},
	{256, 726, 0x203f76},
	{269, 725, 0x062867},
	{302, 726, 0x093991}
}

-- 选中状态的底部竞技场
colorTable["pvpFieldChoosedColor"] = {
	{163, 886, 0xf3ffff},
	{167, 889, 0xeeffff},
	{163, 893, 0xddf3ff},
	{182, 891, 0x2a336e},
	{187, 890, 0x9da5c5},
	{191, 887, 0xcbd7e6},
	{161, 920, 0x2161c2},
	{187, 920, 0x78d7ff},
	{200, 915, 0x001671},
	{208, 925, 0x074793}
}

-- 决斗列表中的休闲决斗
colorTable["funnyPvpColor"] = {
	{74, 590, 0xffcc00},
	{47, 591, 0xffcc00},
	{25, 575, 0x0d2606},
	{25, 600, 0x08a405},
	{23, 621, 0x08a405},
	{24, 642, 0x08a405},
	{24, 560, 0x0e4100},
	{51, 573, 0xbb9600},
	{51, 608, 0xffcc00},
	{21, 632, 0x08a405}
}

-- 休闲决斗开始
colorTable["funnyPvpStartColor"] = {
	{177, 388, 0x0f2a5a},
	{190, 385, 0xe6da0c},
	{196, 388, 0x0b214b},
	{190, 410, 0x0c234d},
	{179, 428, 0x3f4f5a},
	{202, 433, 0xe6eaf1},
	{226, 416, 0x13284e},
	{232, 409, 0x0b224d},
	{245, 416, 0xfbc119},
	{263, 420, 0x0c234f}
}

-- 底部下一步
colorTable["bottomNextColor"] = {
	{235, 901, 0xc1c7d1},
	{241, 903, 0x818897},
	{244, 904, 0xffffff},
	{250, 902, 0xffffff},
	{248, 909, 0xe1e3e7},
	{243, 909, 0x2b3b5b},
	{251, 915, 0x062c6f},
	{265, 915, 0x083689},
	{269, 911, 0x041b44},
	{271, 912, 0x051d4a}
}

-- 底部确定
colorTable["bottomSureColor"] = {
	{246, 912, 0x052156},
	{250, 913, 0xffffff},
	{250, 913, 0xffffff},
	{254, 914, 0xffffff},
	{257, 908, 0xffffff},
	{261, 913, 0xadafb4},
	{264, 913, 0x494e56},
	{262, 911, 0xffffff},
	{271, 911, 0x083382},
	{272, 911, 0x07307a}
}
-- 战斗结束后升级
colorTable["BattleAfterLevelUp"] = {
	{150, 285, 0xffffff},
	{151, 285, 0xffffff},
	{155, 284, 0xffffff},
	{156, 285, 0xffffff},
	{157, 285, 0xffffff},
	{187, 289, 0xffffff},
	{188, 289, 0xffffff},
	{189, 289, 0xffffff},
	{190, 289, 0xffffff},
	{192, 289, 0xffffff}
}

-- 全屏弹框返回
colorTable["FullScreenPopBack"] = {
	{30, 927, 0xffffff},
	{31, 927, 0xffffff},
	{32, 927, 0xffffff},
	{34, 927, 0xffffff},
	{35, 927, 0xffffff},
	{36, 927, 0xffffff},
	{37, 927, 0xffffff},
	{38, 927, 0xffffff},
	{40, 927, 0xffffff},
	{41, 927, 0xffffff}
}

-- 登录后游戏主页面
colorTable["loginAfterMain"] = {
	{29, 52, 0x77ffff},
	{29, 54, 0x33eeff},
	{29, 55, 0x55ddff},
	{29, 56, 0x66ccee},
	{29, 57, 0x66ddee},
	{29, 58, 0x77ffff},
	{29, 60, 0x99ffff},
	{29, 61, 0x88ffff},
	{29, 62, 0x66ffff},
	{29, 63, 0x66eeff}
}
-- 战斗开始后 你的主要阶段
colorTable["battleYourMain"] = {
	{381, 59, 0x0d0a00},
	{379, 56, 0x251e00},
	{380, 57, 0xffcc00},
	{380, 58, 0xfecb00},
	{380, 59, 0x010100},
	{380, 60, 0x000000},
	{380, 62, 0x4b3c00},
	{380, 63, 0xffcc00},
	{380, 64, 0xfecb00},
	{380, 65, 0x010100}
}

-- 战斗开始后 你的抽卡阶段
colorTable["battleYourInCard"] = {
	{394, 62, 0xffcc00},
	{394, 63, 0x977900},
	{394, 64, 0xffcc00},
	{394, 65, 0xffcc00},
	{394, 66, 0xffcc00},
	{394, 68, 0xffcc00},
	{394, 69, 0xffcc00},
	{395, 69, 0xc19a00},
	{395, 70, 0xcaa202},
	{394, 71, 0xffcc00}
}

-- 战斗开始后 你的战斗阶段
colorTable["battleYourFight"] = {
	{369, 55, 0xffcc00},
	{369, 56, 0xffcc00},
	{369, 57, 0xffcc00},
	{370, 57, 0xdaae00},
	{370, 56, 0x604d00},
	{370, 58, 0xffcc00},
	{369, 58, 0xffcc00},
	{369, 59, 0xffcc00},
	{369, 60, 0xffcc00},
	{369, 64, 0x0c0a00}
}

-- 主要阶段的召唤卡片阶段
colorTable["mainWakeCard"] = {
	{217, 739, 0xffffff},
	{218, 740, 0xffffff},
	{218, 741, 0xffffff},
	{218, 742, 0xffffff},
	{218, 743, 0xffffff},
	{218, 744, 0xffffff},
	{218, 746, 0x999999},
	{218, 747, 0x000000},
	{218, 748, 0x000000},
	{218, 749, 0x000000}
}

-- 二号卡槽没卡
colorTable["withoutSecondCard"] = {
	{303, 530, 0x9e9ea7},
	{303, 531, 0x9e9ea7},
	{303, 532, 0x9e9ea7},
	{303, 533, 0x9e9ea7},
	{303, 534, 0x9e9ea7},
	{303, 536, 0x9e9ea7},
	{303, 537, 0x9e9ea7},
	{303, 538, 0x9e9ea7},
	{303, 539, 0x9e9ea7},
	{303, 540, 0x9e9ea7}
}

-- 一号卡槽没卡
colorTable["withoutFirstCard"] = {
	{194, 496, 0x9fa0a1},
	{194, 497, 0x9e9ea6},
	{194, 498, 0x9e9ea6},
	{194, 500, 0x9d9da6},
	{194, 501, 0x9d9da6},
	{194, 502, 0x9d9da6},
	{194, 503, 0x9d9da6},
	{194, 504, 0x9d9da5},
	{194, 506, 0x9d9da5},
	{194, 507, 0x9d9da5}
}

-- 三号卡槽没卡
colorTable["withoutThirdCard"] = {
	{412, 496, 0x595e6d},
	{412, 497, 0x7c7f8e},
	{412, 498, 0x828593},
	{412, 500, 0x8d8f9b},
	{412, 501, 0x92939e},
	{412, 502, 0x9697a1},
	{412, 503, 0x9a9aa3},
	{412, 504, 0x9d9da5},
	{412, 506, 0x9d9da5},
	{412, 507, 0x9d9da6}
}

-- 战斗开始后的第一回合
colorTable["BattleFristRound"] = {
	{413, 26, 0xffffff},
	{413, 27, 0xffffff},
	{413, 28, 0xffffff},
	{416, 28, 0x000000},
	{418, 27, 0x000000},
	{419, 27, 0x03337a},
	{411, 27, 0xffffff},
	{411, 28, 0xffffff},
	{411, 29, 0xffffff},
	{411, 30, 0xffffff}
}

-- 战斗开始后的一位数回合
colorTable["BattleOneDigitRound"] = {
	{432, 21, 0x003066},
	{431, 22, 0x0e3377},
	{433, 22, 0x003377},
	{433, 23, 0x001455},
	{434, 23, 0x001f55},
	{434, 24, 0x001f55},
	{435, 28, 0x033377},
	{435, 33, 0x0e3377},
	{436, 33, 0x032577},
	{437, 32, 0x003077}
}

-- 第一张卡片打过了
colorTable["firstCardUsed"] = {
	{136, 481, 0x000007},
	{137, 482, 0x00000a},
	{139, 483, 0x00000d},
	{140, 484, 0x000011},
	{141, 485, 0x000015},
	{142, 486, 0x000019},
	{143, 487, 0x00001d},
	{145, 488, 0x000121},
	{146, 489, 0x000025},
	{147, 490, 0x000026}
}

-- 第二张卡片打过了
colorTable["secondCardUsed"] = {
	{237, 484, 0x000010},
	{238, 485, 0x000013},
	{239, 486, 0x000017},
	{241, 487, 0x00001c},
	{242, 488, 0x000021},
	{243, 489, 0x000128},
	{244, 490, 0x00012b},
	{244, 490, 0x00012b},
	{245, 491, 0x00012c},
	{260, 490, 0x00002b}
}

-- 第三张卡片不能打
colorTable["thirdCardUsed"]= {
	{350, 480, 0x000002},
	{351, 481, 0x000005},
	{352, 482, 0x000009},
	{353, 483, 0x00000d},
	{355, 484, 0x000011},
	{356, 485, 0x000015},
	{357, 486, 0x000019},
	{358, 487, 0x00001b},
	{359, 488, 0x000121},
	{361, 489, 0x000126}
}

-- 我的战斗阶段发生倒回
colorTable["fightRollBack"] = {
	{187, 448, 0x1e1e1e},
	{187, 449, 0x2b2b2b},
	{187, 450, 0x2b2b2b},
	{187, 452, 0x2b2b2b},
	{187, 454, 0x2b2b2b},
	{187, 456, 0x2b2b2b},
	{187, 458, 0x2b2b2b},
	{187, 460, 0x1e1e1e},
	{187, 462, 0x0b0b0b},
	{187, 464, 0xfdfdfd}
}

-- 底部NPC聊天
colorTable["bottomChat"] = {
	{158, 837, 0xffffff},
	{159, 838, 0xffffff},
	{160, 838, 0xffffff},
	{161, 838, 0xffffff},
	{163, 838, 0xffffff},
	{164, 838, 0xffffff},
	{165, 838, 0xffffff},
	{166, 838, 0xffffff},
	{167, 838, 0xffffff},
	{169, 838, 0xffffff}
}

-- 更换决斗门
colorTable["changeDoor"] = {
	{98, 96, 0x616d9a},
	{98, 98, 0xfafbfc},
	{98, 99, 0xf9fafc},
	{98, 100, 0xf9fafc},
	{98, 101, 0xfefefe},
	{98, 102, 0xffffff},
	{98, 104, 0xf9fafc},
	{98, 105, 0xf9fafc},
	{98, 106, 0xfbfcfd},
	{98, 107, 0xffffff}
}
-- 弹框点击确定
doorPopSure = {
	{364, 542, 0xc1c6ce},
	{364, 544, 0x03132f},
	{364, 545, 0x13233f},
	{364, 546, 0x546075},
	{364, 547, 0xb8bdc5},
	{364, 548, 0xf4f5f6},
	{364, 550, 0xffffff},
	{364, 551, 0xf3f4f5},
	{364, 552, 0xd3d5da},
	{364, 554, 0xbec2cb}
}
-- 确认决斗
doorPveSure = {
	{254, 826, 0xf6e934},
	{254, 827, 0xf7e532},
	{255, 827, 0xf7e532},
	{255, 828, 0xf7e230},
	{255, 829, 0xf7df2e},
	{255, 831, 0xf8d829},
	{255, 832, 0xf9d527},
	{255, 832, 0xf9d527},
	{255, 833, 0xf9d225},
	{255, 834, 0xf9cf23}
}
-- 钥匙数量不足
doorKeyNoStock = {
	{108, 824, 0xb4b4b5},
	{108, 825, 0x848486},
	{107, 828, 0xffffff},
	{108, 829, 0xffffff},
	{115, 829, 0xffffff},
	{124, 829, 0xffffff},
	{127, 831, 0xc8c8c9},
	{140, 831, 0xffffff},
	{140, 832, 0xffffff},
	{140, 833, 0xffffff}
}
-- 切换阶段
changeRound = {
	{473, 603, 0xffffff},
	{474, 605, 0xffffff},
	{474, 607, 0xffffff},
	{474, 616, 0xddffff},
	{474, 619, 0xdbefff},
	{474, 622, 0xcbfdff},
	{474, 624, 0xbef4ff},
	{474, 627, 0xabefff},
	{474, 629, 0xa2f2ff},
	{474, 631, 0x99eeff}
}
-- 你的回合
yourRound = {
	{400, 135, 0x0123cd},
	{402, 135, 0x0430cf},
	{403, 135, 0x0133d9},
	{404, 135, 0x072ccc},
	{405, 135, 0x0133d7},
	{406, 135, 0x0736d8},
	{408, 135, 0x0a42d7},
	{409, 135, 0x0644dc},
	{410, 135, 0x0644d9},
	{411, 135, 0x0844dd}
}
-- 网络失败
noNetWork = {
	{362, 529, 0xffffff},
	{362, 530, 0xb9bcc2},
	{362, 531, 0x7c8390},
	{362, 532, 0xb5b9c1},
	{362, 533, 0xadb3be},
	{362, 534, 0xacb1bc},
	{362, 535, 0xacb2bc},
	{362, 536, 0xacb2bc},
	{362, 537, 0xaeb4bf},
	{362, 538, 0xb5bac5}
}
-- 链接超时
netWorkOutTime = {
	{251, 518, 0xffffff},
	{255, 527, 0xd8dadc},
	{254, 527, 0xffffff},
	{254, 526, 0xffffff},
	{253, 526, 0x9da0a7},
	{253, 525, 0xa4a6ac},
	{252, 526, 0x020a19},
	{252, 523, 0xffffff},
	{250, 523, 0xffffff},
	{250, 522, 0xfefefe}
}
-- 连接错误
netWorkError = {
	{248, 530, 0xc8ccd6},
	{250, 531, 0x9da1aa},
	{250, 532, 0xabafb7},
	{250, 533, 0xe4e6e9},
	{250, 534, 0xfefefe},
	{250, 535, 0xffffff},
	{250, 536, 0xffffff},
	{250, 537, 0xffffff},
	{247, 541, 0x0c234d},
	{248, 542, 0x03183d}
}
